---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregate.AddAggregate
source: html/c94ca7e9-aed8-5a2b-6c7c-fa6593bd395a.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.AddAggregate Method

Creates a nested aggregate and adds it to the aggregate.

## Syntax (C#)
```csharp
public IFCAggregate AddAggregate()
```

## Returns
The nested aggregate.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The aggregate is not valid.